{
    "Routine Butler": "In this project, Sonny built an impressive RaspberryPi contraption that locks his phone away and serves him customizable routine sequences via a kiosk. He's been using it for months and always brings it home when he visits.<br><br><a href='https://youtu.be/tgMPWkEgMcY' target='_blank'>Here</a> is a <b><i>very</i></b> hastily slapped-together video he made to explain more. He hopes to improve this explanation video in the future.<br><br>You can also check out <a href='https://github.com/sonnygeorge/routine-butler' target='_blank'>the code</a> for this project. I would especially recommend checking out <a href='https://github.com/sonnygeorge/routine-butler/blob/main/tests/plugins/_flashcards/test_calculations.py' target='_blank'>a few</a> of the automated tests!",
    "Rick & Morty Speaker Attribution": "In this project, Sonny demonstrates how a handful of coding tricks, like <u>the strategy pattern</u>, can be used to better perform and track modeling experiments.<br><br>You can check out the code and writeup for this project <a href='https://github.com/sonnygeorge/rick-and-morty-speaker-identification' target='_blank'>here</a>.<br><br>You can also explore the experiment results and feed your own text to the model with <a href='https://rick-and-morty-speaker-identification.streamlit.app/' target='_blank'>this</a> Streamlit app.",
    "Papiamentu ASR System": "In <a href='https://github.com/sonnygeorge/papiamentu-asr-corpus'>this</a> project, Sonny and a partner built an automated speech recognition system for Papiamentu, a \"low-resource\" language spoken on the islands of Aruba, Bonaire, and Curaçao.<br><br>First, they built a dataset by:<br><br><li>Webscraping over 22 hours of audio</li><br><li>Using <b><i>force alignment</i></b> to make transcripts with timestamps</li><br><li>Partitioning utterances with <b><i>Spacy</i></b>'s Spanish sentence tokenizer.</li><br>Then, they used <b><i>Resemblyzer</b></i> speaker embeddings and <b><i>spectral clustering</b></i> to determine train, test, and dev splits with minimal speaker bias.<br><br>Finally, they fine-tuned <b><i>whisper-tiny</b></i> and achieved a <b><i>Word Error Rate</b></i> of .61  on their test set, which was a 38% improvement over <b><i>whisper-tiny</b></i>. You can download/test the model via the <a href='https://huggingface.co/sonnygeorge/whisper-tiny-papi' target='_blank'>HuggingFace repository</a>.",
    "Communication Honorable Mentions": "Sonny is a very resourceful visual communicator. He is especially good at creating quick-and-dirty visual aids that help him describe otherwise hard-to-articulate technical concepts.<br><br> One example is <a href='https://youtu.be/RByc443Ub84'>this</a> video, in which Sonny uses a whiteboard and Google Slides to communicate the idea behind a language tool.<br><br>Another nifty example is this .gif that he made to communicate how a VSCode extension could be built that augments the user experience of exploring the modules of a codebase with the help of LLMs:<br><br><img width=428px height=270px background-size:'contain src='assets/code_spelunker.gif' alt='VSCode Extension Gif'>",
    "Interactive Portfolio Site": "Last, but not least of course, is the interactive portfolio website that you are on right now!<br><br>Sonny made this with vanilla <b><i>Javascript</b></i>, <b><i>HTML</b></i>, and <b><i>CSS</b></i>.<br><br>He is by no means a front-end guru, but he definitely knows his way around fun and interactive GUIs! You can find the code <a href='https://github.com/sonnygeorge/interactive-portfolio'>here</a>."
}
